#+TITLE: Rug-IPA
#+AUTHOR: Vegard Sjonfjell og Johan Fjeldtvedt
#+DATE: Tirsdag 28. Mai 2019
#+OPTIONS: toc:nil

* Meta
Basert på Superfresh Citrus IPA

* Tidspunkt
Brygging 2019-05-31

* Ingredienser
#+BEGIN_SRC hy :results none :session bjarne :exports none
     (defmacro define-ingredients [coll-name &rest args]
       `(do
          (global ~coll-name)
          (setv ~coll-name ~args)))

     (deftag scale [orig-value] `(* ~orig-value (/ volume orig-volume)))
     (deftag lbs [value] `(* ~value 453.592))
     (deftag oz [value] `(* ~value 28.3495))
     (deftag kg [value] `(* ~value 1000))

     (defn format-time [_ item]
       (.format "{0} min" (:time item)))

     (defn format-grams [_ item]
       (.format "{:.0f} g" (:grams item)))

     (defn get-total [coll key]
       (reduce + (map (fn [item] (get item key)) coll)))

     (defn --percentage [key]
       (fn [coll item]
         (setv total (get-total coll key))
         (.format "{:.2f} %" (* 100 (/ (get item key) total)))))

     (defmacro percentage [key]
       `(--percentage '~key))

     (defn to-table [coll keys]
       (list (map
               (fn [item]
                 (list (map (fn [k] (if (keyword? k)
                                        (get item k)
                                        (k coll item)))
                            keys)))
               coll)))
#+END_SRC
#+BEGIN_SRC hy :results none :session bjarne :exports none
  (setv volume 28)
  (setv orig-volume 25)
  (setv boil-time 90)

  (define-ingredients grains
    {:grams #scale #kg 5.951 :name "Best Pale Ale Malt (5 EBC)"}
    {:grams #scale #kg 0.275 :name "Best Caramell Hell (30 EBC)"}
    {:grams #scale #kg 0.275 :name "Best Wheat Malt (5 EBC)"}
    {:grams #scale #kg 0.5 :name "Rye Malt"})

  (define-ingredients hops
    {:time 60 :name "Mandarina Bavaria 7%" :grams #scale 40 #kg}
    {:time 15 :name "Mandarina Bavaria 7%"  :grams #scale 15}
    {:time "hop-stand" :name "Mandarina Bavaria 7%" :grams #scale 25}
    {:time "hop-stand" :name "Citra 13%" :grams #scale 50}
    {:time "dryhop" :name "Mandarina Bavaria 7%" :grams #scale 40}
    {:time "dryhop" :name "Citra 13%" :grams #scale 50})
#+END_SRC

** Malt
#+BEGIN_SRC hy :session bjarne :results output table :exports results
      (to-table grains [:name format-grams (percentage :grams)])
#+END_SRC

#+RESULTS:
| Best Pale Ale Malt (5 EBC)  | 6665 g | 85.00 % |
| Best Caramell Hell (30 EBC) | 308 g  | 3.93 %  |
| Best Wheat Malt (5 EBC)     | 308 g  | 3.93 %  |
| Rye Malt                    | 560 g  | 7.14 %  |

** Humle
#+BEGIN_SRC hy :session bjarne :results output table :exports results
      (to-table hops [:name format-grams (percentage :grams)])
#+END_SRC
    
#+RESULTS:
| Mandarina Bavaria 7% | 45 g | 18.18 % |
| Mandarina Bavaria 7% | 17 g | 6.82 %  |
| Mandarina Bavaria 7% | 28 g | 11.36 % |
| Citra 13%            | 56 g | 22.73 % |
| Mandarina Bavaria 7% | 45 g | 18.18 % |
| Citra 13%            | 56 g | 22.73 % |
    
* Mesking
Mesk i 60 minutter ved gjennomsnittlig 65 grader. TODO Meskevann

* Skylling
TODO Skyllevann
   
* Koking
Kok i 90 minutter.
Humle disponeres i kokeapparat på følgende måte.
   
#+BEGIN_SRC hy :session bjarne :results output table :exports results
      (to-table hops [:name format-time format-grams])
#+END_SRC
   
#+RESULTS:
| Mandarina Bavaria 7% | 60 min        | 45 g |
| Mandarina Bavaria 7% | 15 min        | 17 g |
| Mandarina Bavaria 7% | hop-stand min | 28 g |
| Citra 13%            | hop-stand min | 56 g |
| Mandarina Bavaria 7% | dry min       | 45 g |
| Citra 13%            | dry min       | 56 g |
   
* Gjæring
To uker på 20 grader
   
* Tapping
